[{"_id":"6936bbbb5e436f365bf4d622","jobNumber":1,"title":"App Developer","description":"As a Process Executive on the world's most loved video-sharing website, you will provide dynamic service and support in relation to the productivity and compliance requirements of our clients. Dedicated to quality, you will use your problem-solving skills to continuously deliver value to our clients. Projects where Cognizant would position you, will allow you to develop as a specialist decision maker on topics that will be very pertinent global issues around social values, free speech and health and safety.\n\nSocial media regulation, online free speech, Internal controls, Support for vulnerable sections of the society, EU policy making, Business process efficiency, project management, Quality improvement – These are some of the qualities and areas of interest we are looking for in our prospective team members.\n\nResponsibilities:\n\n· Understand and remain up to date with client’s policies and guidelines.\n\n· Review user reports regarding website content.\n\n· Analyze and identify content on creator channels that is not in compliance with requirements and flag for action in a timely manner.\n\n· Make well-balanced decisions and help resolve inquiries according to defined policies and procedures.\n\n· Serve as an advocate for the user community.\n\n· Investigate and resolve issues that are reported on such as requests for account support and reports of potentially abusive content.\n\n· Review the reported content within agreed turnaround times and standards of quality.\n\n· Recognize trends and patterns and escalate issues outside policy.\n\n· Fulfill base productivity and quality requirements of the client.\n\n· Respond to user inquiries with high quality, speed, empathy, and accuracy.\n\n· Gather, analyze, and utilize relevant data to develop ways to improve overall user experience.\n\n· Use market specific knowledge, signals, and insights to spot and scope scalable solutions to improve the support of user community.\n\n· Identify inefficiencies in workflows and suggest solutions.\n\n· Review of sensitive content sometimes involving graphic or disturbing subject matter.\n\nProfessional Skills Requirements\n\n· Well-developed logic-based decision making and ability to triage and escalate borderline cases\n\n· Excellent communication (verbal and written), facilitation, and interpersonal skills\n\n· Passion for corporate mission and ensuring a world class user support experience\n\n· Quick learner and adaptable to learn new processes, concepts, and skills\n\n· Excellent organizational and time management skills\n\n· Results-oriented, self-directed, and inquisitive","location":"Hyderabad","type":"full_time","experience":"2","department":"JAVA","status":"open","postedAt":"2025-12-08T11:51:23.377Z","updatedAt":"2025-12-08T11:51:23.377Z","__v":0}]
